app/views/workouts/show.html.erb

<div class="greybox">
	<% @workout.exercises.each do |one_exercise| %>
---
SELECT "exercises".* FROM "exercises"  WHERE "exercises"."workout_id" = $1  [["workout_id", 2]]