app/controllers/exercises_controller.rb

	def index
		@workout = Workout.all.sample()
---
SELECT "workouts".* FROM "workouts"

	def show
		@exercise = Exercise.find(params[:id])
---
SELECT  "exercises".* FROM "exercises"  WHERE "exercises"."id" = $1 LIMIT 1  [["id", 2]]

	def user_completed_workout
		user = User.find(session[:current_user_id])
		workout = Workout.find(params[:workout_id])
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1  [["id", 4]]
SELECT  "workouts".* FROM "workouts"  WHERE "workouts"."id" = $1 LIMIT 1  [["id", 2]]