app/controllers/users_controller.rb

INSERT INTO "users" ("age", "created_at", "name", "password_digest", "updated_at", "username") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
	def create
		@user = User.new(user_params)
		if @user.save