app/controllers/workouts_controller.rb

	def show
		@workout = Workout.all.sample()
---
SELECT "workouts".* FROM "workouts"

	def complete
		user = User.find(session[:current_user_id])
		workout = Workout.find(params[:id])
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1  [["id", 4]]
SELECT  "workouts".* FROM "workouts"  WHERE "workouts"."id" = $1 LIMIT 1  [["id", 2]]